Repository: sushain97/apertium-monorepo-svn-82937
Catalog: incubator/en-ga-corpus/tmx/1922-2.tmx
Source language: en
Languages: ga

source: ADAPTATION OF ENACTMENTS ACT, 1922
ga: ACHT UM OIRIÚNÚ ACHTANNA, 1922

source: AN ACT TO INTERPRET AND TO ADAPT TO THE CIRCUMSTANCES OF SAORSTÁT EIREANN CERTAIN ACTS OF THE BRITISH PARLIAMENT HAVING THE FORCE OF LAW IN SAORSTÁT EIREANN AND CERTAIN STATUTORY RULES ORDERS AND REGULATIONS AND CERTAIN CONTRACTS
ga: ACHT CHUN ACHTANNA ÁIRITHE DE PHÁIRLIMINT NA BREATAINE GO BHFUIL FEIDHM DLÍ ACA I SAORSTÁT ÉIREANN AGUS CHUN RIALACHA, ORDUITHE AGUS RIALACHÁIN REACHTÚLA ÁIRITHE AGUS CONNARTHA ÁIRITHE DO LÉIRIÚ AGUS DO CHUR IN OIRIÚINT DO CHÚRSAÍ SHAORSTÁIT ÉIREANN

source: WHEREAS it is provided by Article 73 of the Constitution of Saorstát Eireann that subject to that Constitution and to the extent to which they are not inconsistent therewith the laws in force in Saorstát Eireann at the date of the coming into operation of that Constitution shall continue to be of full force and effect until the same or any of them shall have been repealed or amended by enactment of the Oireachtas:
ga: DE BHRÍ go bhforálann Airtiogal 73 de Bhun-reacht Shaorstáit Éireann na dlithe a bhí i bhfeidhm i Saorstát Éireann le linn teacht i ngníomh don Bhun-reacht san do leanúint i lánneart agus i lán-fheidhm gan dochar don Bhun-reacht san agus sa mhéid ná fuilid buiniscionn leis, go dtí go n-ath-ghairmfear no go leasófar gach ceann no aon cheann aca le hachtú den Oireachtas:

source: AND WHEREAS all Acts passed by the British Parliament which were in force on the 6th day of December, 1922 (being the date of the coming into operation of the Constitution aforesaid) in the area now comprised in Saorstát Eireann will by virtue of the said Article 73 have the force of law in Saorstát Eireann:
ga: AGUS DE BHRÍ go mbeidh feidhm dlí i Saorstát Éireann de bhuadh an Airtiogail 73 roimh-ráite ag na hAchtanna uile do rith Páirlimint na Breataine agus do bhí i bhfeidhm ar an 6adh lá de Mhí na Nodlag, 1922 (an dáta a tháinig an Bunreacht roimh-ráite i bhfeidhm) san líomatáiste gurb é Saorstát Éireann anois é:

source: AND WHEREAS it is necessary in order to enable such Acts to have full force and effect in Saorstát Eireann that certain interpretations and adaptations of such Acts and of all orders rules and regulations made thereunder should be made:
ga: AGUS DE BHRÍ go bhfuil sé riachtanach na hAchtanna san agus na horduithe, na rialacha agus na rialacháin uile a déanfar fútha do léiriú agus do chur in oiriúint i slite áirithe chun go mbeidh lán-neart agus lán-fheidhm ag na hAchtanna san i Saorstát Éireann:

source: AND WHEREAS it is desirable to make provision for the continuance of pending Government contracts:
ga: AGUS DE BHRÍ gur mhaith an ní é foráil do dhéanamh chun leanúint de sna connartha Rialtais atá ar fionnraí:

source: BE IT THEREFORE ENACTED BY THE OIREACHTAS OF SAORSTÁT EIREANN AS FOLLOWS:—
ga: ACHTUIGHEADH OIREACHTAS SHAORSTÁIT ÉIREANN AR AN ÁBHAR SAN MAR LEANAS:—

source: 1.— (1) The Fund mentioned in Article 61 of the Constitution of Saorstát Eireann as the one fund to be formed subject as therein of all the revenues of Saorstát Eireann shall be called and known as "The Central Fund of Saorstát Eireann," and may for brevity be referred to in any Act of the Oireachtas, Statutory Rule or Order or other state or official document as "The Central Fund."
ga: 1. —(1) An Ciste atá luaidhte in Airtiogal 61 de Bhun-reacht Shaorstáit Éireann mar an t-aon chiste amháin a dhéanfaidh d'fháltas uile Shaorstáit Éireann gan dochar do ní áirithe mar a luaidhtear ann glaofar “Prímh-Chiste Shaorstáit Éireann” air agus is mar sin aithneofar é, agus féadfar mar chomhgar “An Prímh-Chiste” do ghairm de in aon Acht den Oireachtas no in aon Riail no Ordú Reachtúil no in aon scríbhinn stáit no scríbhinn oifigiúil eile

source: (2) Every mention of and reference to the Consolidated Fund contained in any British Statute shall, where the context so requires or admits, be construed and take effect as respects the doing or not doing after the 6th day of December, 1922, of any act, matter or thing in Saorstát Eireann under or in pursuance of such Statute as a mention of or reference to The Central Fund
ga: (2) Nuair a éilíonn no a cheaduíonn an có-théacs é déanfar gach luadh agus tagairt don Chiste Chó-dhlúite atá in aon Reacht Briotáineach do léiriú agus d'fheidhmiú mar luadh agus mar thagairt do An Phrímh-Chiste i dtaobh aon ghníomha, ruda no ní do dhéanamh no d'fhágaint gan déanamh tar éis an 6adh lá de Mhí na Nodlag, 1922, i Saorstát Éireann fén Reacht san no dá réir

source: —Every mention of or reference to the Exchequer or the Comptroller and Auditor-General contained in any British Statute shall in respect of the doing or not doing of any act, matter or thing after the 6th day of December, 1922, in Saorstát Eireann, under or in pursuance of such Statute be respectively construed and take effect where the context so admits or requires as a mention of or reference to the Exchequer of Saorstát Eireann or to the Comptroller and Auditor-General of Saorstát Eireann as the case may require
ga: —Nuair a cheaduíonn no a éilíonn an co-théacs é déanfar gach luadh no tagairt don Stát-Chiste no don Árd-Scrúdóir atá in aon Reacht Briotáineach do léiriú agus d'fheidhmiú fé seach mar luadh no mar thagairt do Stát-Chiste Shaorstáit Éireann no d'Árd-Scrúdóir Shaorstáit Éireann fé mar a theastóidh i dtaobh aon ghníomha, ruda no ní do dhéanamh no d'fhágaint gan déanamh tar éis an 6adh lá de Mhí na Nodlag, 1922, i Saorstát Éireann fén Reacht san no dá réir

source: —For the purpose of the construction of any British Statute the name "Ireland," whether used alone or in conjunction with the expression "Great Britain," or by implication as being to included in the expression "United Kingdom" shall mean Saorstát Eireann
ga: —Chun críche léirithe aon Reachta Bhriotáinigh ciallóidh an ainm “Ireland” Saorstát Éireann, pe'ca bheidh “Ireland” ’na aonar no i dteanta na habairte “Great Britain” no go dtuigfear é do bheith foluithe san abairt “United Kingdom.”

source: —Every mention of or reference to the Dublin Gazette contained in any British Statute shall, as respects the doing or not doing of any act, matter or thing in Saorstát Eireann after the 6th day of December, 1922, be construed and take effect as a mention of or reference to the official gazette called Iris Oifigiúil
ga: —Déanfar gach luadh no tagairt don Dublin Gazette atá in aon Reacht Briotáineach do léiriú agus d'fheidhmiú mar luadh no mar thagairt don Iris Oifigiúil i dtaobh aon ghníomha, ruda no ní do dhéanamh no d'fhágaint gan déanamh i Saorstát Éireann tar éis an 6adh lá de Mhí na Nodlag, 1922

source: —(1) Every mention of or reference to Parliament or to both or each or either of the Houses of Parliament contained in any British Statute shall as respects the doing or not doing of any act, matter or thing after the 6th day of December, 1922, in Saorstát Eireann be construed as a mention of or reference to both or each or either of the Houses or the corresponding House (as the case may require) of the Oireachtas and the expression "Parliamentary" in every such Statute shall be construed accordingly
ga: —(1) Déanfar gach luadh no tagairt do Pháirlimint no do sna Tighthe Páirliminte araon no do gach ceann no d'aon cheann aca atá in aon Reacht Briotáineach do léiriú mar luadh no mar thagairt don dá Thigh no do gach ceann no d'aon cheann aca no don Tigh chó-réire (fé mar a theastóidh) den Oireachtas i dtaobh aon ghníomha, ruda no ní do dhéanamh no d'fhágaint gan déanamh tar éis an 6adh lá de Mhí na Nodlag, 1922, i Saorstát Éireann agus léireofar dá réir sin an focal “Parliamentary” i ngach Reacht dá shórt

source: (2) Every mention of or reference to the presentation of an address to His (or Her) Majesty by both or each or either of the Houses of Parliament contained in any British Statute shall as from the 6th day of December, 1922, be construed and take effect as a mention of or reference to the passing of a resolution by both or each or either of the Houses or by the corresponding House (as the case may require) of the Oireachtas
ga: (2) Gach luadh no tagairt do thairisgint dileagra dá Shoillse ó sna Tighthe Páirliminte araon no ó gach ceann no aon cheann aca atá in aon Reacht Briotáineach léireofar agus feidhmeofar iad ón 6adh lá de Mhí na Nodlag, 1922, mar luadh no mar thagairt do rún do rith Tighthe an Oireachtais araon no gach ceann no aon cheann aca no an Tigh có-réire (fé mar a theastóidh)

source: (3) For the purposes of this section Seanad Eireann shall be deemed to be the House of the Oireachtas corresponding to the Peers' House of the British Parliament and Dáil Eireann shall be deemed to be the House of the Oireachtas corresponding to the Commons' House of the British Parliament
ga: (3) Chun crícheanna an ailt seo tuigfear gurb é Seanad Éireann an Tigh Oireachtais atá ar có-réir le Tigh na dTiarnaí de Pháirlimint na Breataine agus tuigfear gurb í Dáil Éireann an Tigh Oireachtais atá ar có-réir le Tigh na gCoitiannach de Pháirlimint na Breataine

source: (4) Notwithstanding anything to the contrary contained in this Section the expression "Act of Parliament" contained in any British Statute shall mean and include either Act of the British Parliament or Act of the Oireachtas, as the case may require
ga: (4) In ainneoin éinní dá mhalairt atá san Alt so ciallóidh agus folóidh an abairt “Act of Parliament” atá in aon Reacht Briotáineach Acht de Pháirlimint na Breataine no Acht den Oireachtas, fé mar a theastoidh

source: —(1) Every power, authority and duty conferred or imposed by any British Statute on a Justice or on two or more Justices acting together shall as from the passing of this Act cease to be exercisable or to be performed by such Justice or Justices and in lieu thereof as respects any act, matter or thing to be done or not done after the passing of this Act every such power or authority may be exercised and every such duty shall be performed by one District Justice
ga: —(1) Gach comhacht, údarás agus dualgas do bronnadh no do cuireadh le haon Reacht Briotáineach ar Ghiúistís no ar bheirt no níos mó Giúistísí ag gníomhú le chéile ní dhéanfaidh an Giúistís ná na Giúistísí sin iad d'fheidhmiú ná do chó-líona tar éis rithte an Achta so agus ’na n-ionad san féadfaidh aon Ghiúistís Dúithche amháin gach comhacht no údarás dá sórt d'fheidhmiú agus déanfa sé gach dualgas dá shórt do chó-líona i dtaobh aon ghníomha, ruda no ní a bheidh le déanamh nó le fágaint gan déanamh tar éis rithte an Achta so

source: (2) Every power, authority and duty conferred or imposed by any British Statute on a Resident Magistrate or on two or more Resident Magistrates acting together shall as from the passing of this Act cease to be exercisable or to be performed by such Magistrate or Magistrates and in lieu thereof as respects any act, matter or thing to be done or not done after the passing of this Act, every such power or authority may be exercised and every such duty shall be performed by one District Justice
ga: (2) Gach comhacht, údarás agus dualgas do bronnadh no do cuireadh le haon Reacht Briotáineach ar Ghiúistís Chomhnuithe no ar bheirt no níos mó Giúistísí Comhnuithe ag gníomhúle chéile ní dhéanfaidh an Giúistís ná na Giúistísí sin iad d'fheidhmiú ná do chó-líona tar éis rithte an Achta so agus ’na n-ionad san féadfaidh aon Ghiúistís Dúithche amháin gach comhacht no údarás dá sórt d'fheidhmiú agus déanfa sé gach dualgas dá shórt do chó-líona i dtaobh aon ghníomha, ruda no ní a bheidh le déanamh no le fágaint gan déanamh tar éis rithte an Achta so

source: (3) In this section ( a ) the expression "Justice" includes the expression "Justice of the Peace," and does not mean or include a Divisional Magistrate of the City of Dublin, and nothing in this Section shall affect the powers, authority and duties of such Divisional Magistrates; ( b ) the expression "District Justice" means a Magistrate appointed since the 6th day of December, 1922, under the British Statute 6 & 7 William IV., Chapter 13
ga: (3) San alt so (a) foluíonn an focal “Giúistís” an abairt “Giúistís Síochána,” agus ní chialluíonn ná ní fholuíonn sé Giúistís Roinne de Chathair Bhaile Atha Cliath, agus ní dhéanfaidh éinní san alt so difríocht do chomachta, d'údarás ná do dhualgaisí na nGiúistísí Roinne sin; (b) cialluíonn an abairt “Giúistís Dúithche” Giúistís do ceapadh tar éis an 6adh lá de Mhí na Nodlag, 1922, fén Reacht Briotáineach, 6 & 7 William IV., Caibideal 13

source: —(1) Wherever any statutory Board of Commissioners or other statutory body to which this section applies was in existence on the 6th day of December, 1921, and had jurisdictions, powers or duties extending to the whole of the late United Kingdom, or to any part thereof, which included the area now comprised in Saorstát Eireann, the Executive Council may, by Order, establish a Board of Commissioners to exercise in Saorstát Eireann the functions which were on the 6th day of December, 1921, exercisable by such statutory Commissioners or statutory body as aforesaid in the area now comprised in Saorstát Eireann
ga: —(1) Pé áit ina raibh Bórd reachtúil Coimisinéirí no aon chólucht reachtúil eile le n-a mbaineann an t-alt so, ar an 6adh lá de Mhí na Nodlag, 1921, agus agá raibh údaráis, comhachtanna no dualgaisí ar fuaid iomláine no coda den Ríocht Aontuithe a bhí ann le déanaí agus ina raibh an líomatáiste gurb é Saorstát Éireann anois é, féadfaidh an Árd-Chomhairle, le hOrdú, Bórd Coimisinéirí do bhunú chun na feidhmeanna san d'fheidhmiú i Saorstát Éireann, a bhí infheidhmithe ar an 6adh lá de Mhí na Nodlag, 1921, ag na Coimisinéirí reachtúla san no ag an gcólucht reachtúil sin mar roimh-ráite san líomatáiste gurb é Saorstát Éireann anois é

source: (2) In exercising the powers conferred by this section, the Executive Council may confer or impose on any one Board of Commissioners established under this section all or any of the several jurisdictions, powers and duties of two or more such statutory Boards of Commissioners or statutory bodies as aforesaid, and may divide the jurisdictions, powers and duties of any such statutory Commissioners or statutory body amongst two or more Boards of Commissioners established under this section: Provided that no Order of the Executive Council made in pursuance of this sub-section shall come into operation unless and until it has been laid before each House of the Oireachtas, and approved by resolution of each such House
ga: (2) I bhfeidhmiú na gcomhacht a bronntar leis an alt so, féadfaidh an Árd-Chomhairle gach ceann no aon cheann d'údaráis, de chomhachtanna agus de dhualgaisí dhá cheann no breis de sna Búird reachtúla san de Choimisinéirí no de sna cóluchtaí reachtúla san mar roimh-ráite do bhronna no do chur ar aon Bhórd Coimisinéirí fé leith a bunófar fén alt so; agus féadfaidh sí údaráis, comhachtanna agus dualgaisí aon Choimisinéirí reachtúla no aon chóluchta reachtúla den tsórt san do roinnt ar dhá cheann no breis de Bhúird Choimisinéirí a bunófar fén alt so: Ar choiníoll ná tiocfaidh i bhfeidhm aon Ordú dá ndéanfaidh an Árd-Chomhairle do réir an fho-ailt seo mara ndéanfar agus go dtí go ndéanfar é do leaga fé bhráid gach Tighe den Oireachtas agus é do mhola le rún ó gach Tigh díobh

source: (3) Whenever the Executive Council establishes under this section any Board of Commissioners, the Executive Council shall, by the Order establishing such Board, apply to such Board with such adaptations and modifications as may be necessary the several British Statutes regulating the Boards of Commissioners or other body or bodies whose or any of whose jurisdictions, powers or duties are by such Order conferred or imposed on such Board
ga: (3) Aon uair a dhéanfaidh an Árd-Chomhairle aon Bhórd Coimisinéirí do bhunú fén alt so, cuirfidh an Árd-Chomhairle i mbaint leis an mBórd san, le hOrdú bunuithe an Bhúird sin, na Reachtanna Briotáineacha iomdha maraon le pé oiriúnuithe agus atharuithe ortha a bheidh riachtanach a rialuíonn na Búird Choimisinéirí no an cólucht no na cóluchtaí eile go ndineann an t-Ordú san a n-údaráis, a gcomhachtanna no a ndualgaisí no aon cheann aca do bhronna no do chur ar an mBórd san

source: (4) This section applies to any statutory Board of Commissioners or other statutory Board or body exercising any function of government or discharging any public duties in relation to public administration
ga: (4) Baineann an t-alt so le haon Bhórd reachtúil Coimisinéirí no le haon Bhórd no cólucht reachtúil eile a fheidhmíonn aon fheidhm rialúcháin no a chó-líonann aon dualgaisí puiblí a bhaineann le riara puibli

source: —(1) Whenever any statutory fund was in existence on the 6th day of December, 1921, and served purposes relating to the whole of the late United Kingdom, or to any part thereof which included the area now comprised in Saorstát Eireann, the Executive Council may by Order establish a fund to serve in Saorstát Eireann the like purposes as were on the 6th day of December, 1921, served in the area aforesaid by such statutory fund
ga: —(1) I gcás aon chiste reachtúla a bhí ann ar an 6adh lá de Mhí na Nodlag, 1921, agus é ag fónamh chun crícheanna a bhain le hiomlán no le cuid den Ríocht Aontuithe a bhí ann le déanaí agus ina raibh an líomatáiste gurb é Saorstát Éireann anois é, féadfaidh an Árd-Chomhairle le hOrdú ciste do bhunú chun fónamh chun na gcrícheanna gcéanna i Saorstát Éireann go raibh an ciste reachtúil sin ag fónamh chúcha sa líomatáiste roimh-ráite ar an 6adh lá de Mhí na Nodlag, 1921

source: (2) Whenever the Executive Council establishes a fund under this section to serve the purposes of any statutory fund, the Executive Council shall, by the Order establishing such fund, apply to such fund with the necessary adaptations and modifications the several Acts of the British Parliament regulating such statutory fund
ga: (2) Aon uair a bhunóidh an Árd-Chomhairle ciste fén alt so chun fónamh chun crícheanna ciste reachtúla ar bith, cuirfidh an Árd-Chomhairle i mbaint leis an gciste sin, le hOrdú bunuithe an chiste sin, na hAchtanna iomdha de Pháirlimint na Breataine a rialuíonn an ciste reachtúil sin agus iad oiriúnuithe agus atharuithe mar a bheidh riachtanach

source: —Wherever under any British Statute any grant, whether annual or capital or any loan or advance is directed or authorized to be made by the Treasury out of the Consolidated Fund or by the Treasury or any other Government Department out of any other fund or any sum of money is authorised to be borrowed by the Treasury or any other Government Department and the amount or the maximum or minimum limit of such grant, loan, advance or sum of money is by such Statute or otherwise fixed either for the whole of the late United Kingdom or for any part thereof which included the area now comprised in Saorstát Eireann, the Minister for Finance (in addition to the adaptations of such Statute made by or under this Act) may by Order apportion such amount or limit between Saorstát Eireann and the rest of the area in respect of which such amount or limit is fixed as aforesaid, and may by such Order fix the amount or the maximum or minimum limit (as the case may be) of such grant, loan, advance or sum of money to be made or borrowed under such Statute in Saorstát Eireann
ga: —Pé áit, fé aon Reacht Briotáineach, go n-orduítear no go n-údaruítear don Chisteán aon deontas, bíodh sé bliantúil no mar bhun-airgead, no aon iasacht no aon roimh-íoc d'íoc as an gCiste Có-dhlúite no go n-orduítear no go n-údaruítear don Chisteán no d'aon Roinn eile Rialtais íoc mar sin as aon chiste eile no go n-údaruítear don Chisteán no d'aon Roinn eile Rialtais aon tsuim airgid d'fháil ar iasacht agus go bhfuil méid no teora méide no luighid an deontais, na hiasachta, an roimhíoca no na suime airgid sin socair ag an Reacht san no ar aon nós eile i gcóir iomláine nó aon choda den Ríocht Aontuithe a bhí ann le déanaí agus ina raibh an líomatáiste gurb é Saorstát Éireann anois é, féadfaidh an t-Aire um Airgead (i dteanta na n-oiriúnuithe a déanfar ar an Reacht san leis no fén Acht so) le hOrdú an méid no an teora san do roinnt idir Shaorstát Éireann agus an chuid eile den líomatáiste gur socruíodh an méid sin no an teora san ’na thaobh mar roimh-ráite, agus féadfa sé leis an Ordú san socrú do dhéanamh ar mhéid no ar theora méide no luighid (fé mar a bheidh) an deontais no na hiasachta no an roimh-íoca no na suime airgid sin a bheidh le n'íoc no le fáil ar iasacht fén Reacht san i Saorstát Éireann

source: —Wherever it is provided in any British Statute that any act or thing shall or may be made or done by Order in Council or by the King (or Queen) in Council, or by Proclamation of the King (or Queen) or of the King (or Queen) in Council, then every such act or thing may be made or done in Saorstát Eireann by an Order of the Governor-General of the Irish Free State upon the advice of the Executive Council of the Irish Free State
ga: —Pé áit ina bhforáltar in aon Reacht Briotáineach go ndéanfar aon ghníomh no ní no go bhféadfar iad do dhéanamh le hOrdú i gComhairle no leis an Rí (no an Bhainríoghain) i gComhairle no le Furógra ón Rí (no ón mBainríoghain) no ón Rí (no ón mBainríoghain) i gComhairle, féadfar gach gníomh no ní den tsórt san do dhéanamh i Saorstát Éireann le hOrdú ó Sheanascal Shaorstáit Éireann ar chomhairle Árd-Chomhairle Shaorstáit Éireann

source: —(1) Subject and without prejudice to the specific adaptations made by this Act or by any Order made under the authority of this Act, every mention or reference contained in any British Statute of or to any Minister, Official, Department or Authority of the Government of the late United Kingdom or of the late British Government in Ireland including the Lord Lieutenant exercising executive functions shall in respect of the doing or not doing of any act, matter or thing after the 6th day of December, 1922, be construed and take effect as a mention of or reference to the Minister, Official, Department or Authority in Saorstát Eireann exercising in Saorstát Eireann functions the same as or corresponding to the functions exercised in respect of the area now comprised in Saorstát Eireann by such Minister, Official, Department or Authority of the Government of the late United Kingdom or the late British Government in Ireland prior to the 6th day of December, 1921; but this section shall not apply to any provision contained in any such Statute relating to the remuneration of any Minister or other official
ga: —(1) Gan dochar ná díobháil do sna hoiriúnuithe áirithe a dintear leis an Acht so no a déanfar le haon Ordú a déanfar fé údarás an Achta so, gach luadh no tagairt atá in aon Reacht Briotáineach d'aon Aire, Oifigeach, Roinn no Údarás de Rialtas na Ríochta Aontuithe a bhí ann le déanaí no den Rialtas Briotáineach a bhí in Éirinn mar aon le Fear Ionaid an Rí ag feidhmiú feidhmeanna léireofar agus feidhmeofar iad i dtaobh aon ghníomha ruda no ní do dhéanamh no d'fhágaint gan déanamh tar éis an 6adh lá de Mhí na Nodlag, 1922, mar luadh no mar thagairt don Aire, don Oifigeach, don Roinn no don Údarás i Saorstát Éireann a fheidhmíonn i Saorstát Éireann feidhmeanna atá ionann no ar có-réir leis na feidhmeanna d'fheidhmíodh an t-Aire, an t-Oifigeach, an Roinn no an t-Údarás san de Rialtas na Ríochta Aontuithe a bhí ann le déanaí no den Rialtas Briotáineach a bhí in Éirinn roimh an 6adh lá de Mhí na Nodlag, 1921, i dtaobh an líomatáiste gurb é Saorstát Éireann anois é: ach ní bhainfidh an t-alt so le haon fhoráil atá in aon Reacht den tsórt san i dtaobh luach saothair aon Aire no oifigigh eile
